#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.blog.azurerm_frontdoor.blog will be created
  + resource "azurerm_frontdoor" "blog" {
      + cname                                        = (known after apply)
      + enforce_backend_pools_certificate_name_check = true
      + id                                           = (known after apply)
      + load_balancer_enabled                        = true
      + location                                     = "global"
      + name                                         = "fd245b8f88d462"
      + resource_group_name                          = "blog-dev"
      + tags                                         = {
          + "provisioned_by" = "terraform"
        }

      + backend_pool {
          + health_probe_name   = "httpscheck"
          + id                  = (known after apply)
          + load_balancing_name = "fastestresponder"
          + name                = "static"

          + backend {
              + address     = "sto245b8f88d462eastus2.z20.web.core.windows.net"
              + enabled     = true
              + host_header = "sto245b8f88d462eastus2.z20.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
          + backend {
              + address     = "sto245b8f88d462northeuro.z16.web.core.windows.net"
              + enabled     = true
              + host_header = "sto245b8f88d462northeuro.z16.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
          + backend {
              + address     = "sto245b8f88d462westeurop.z6.web.core.windows.net"
              + enabled     = true
              + host_header = "sto245b8f88d462westeurop.z6.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
          + backend {
              + address     = "sto245b8f88d462westus2.z5.web.core.windows.net"
              + enabled     = true
              + host_header = "sto245b8f88d462westus2.z5.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + id                  = (known after apply)
          + interval_in_seconds = 30
          + name                = "httpscheck"
          + path                = "/"
          + protocol            = "Https"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "fastestresponder"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + custom_https_provisioning_enabled = false
          + host_name                         = "fd245b8f88d462.azurefd.net"
          + id                                = (known after apply)
          + name                              = "azurefd"
          + session_affinity_enabled          = false
          + session_affinity_ttl_seconds      = 0
        }
      + frontend_endpoint {
          + custom_https_provisioning_enabled = true
          + host_name                         = "dev.mattwhite.blog"
          + id                                = (known after apply)
          + name                              = "dev-mattwhite-blog"
          + session_affinity_enabled          = false
          + session_affinity_ttl_seconds      = 0

          + custom_https_configuration {
              + azure_key_vault_certificate_secret_name    = "dev-mattwhite-blog"
              + azure_key_vault_certificate_secret_version = "b16a795aa95e4f2b8715c80d5b68c2b8"
              + azure_key_vault_certificate_vault_id       = "/subscriptions/814a2d9d-752d-4ecb-bb2a-fc0321152d4b/resourceGroups/blog-dev/providers/Microsoft.KeyVault/vaults/kv245b8f88d462"
              + certificate_source                         = "AzureKeyVault"
              + provisioning_state                         = (known after apply)
              + provisioning_substate                      = (known after apply)
            }
        }

      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "azurefd",
              + "dev-mattwhite-blog",
            ]
          + id                 = (known after apply)
          + name               = "https"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "static"
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = true
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "azurefd",
              + "dev-mattwhite-blog",
            ]
          + id                 = (known after apply)
          + name               = "https-redirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "dev.mattwhite.blog"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Workflow: `Terraform CICD`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform`*
